1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаСписанияНоменклатурыПодЗаказ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодЗаказ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ТипыСписанияНоменклатурыВПроизводство</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаСписанияНоменклатурыПодЗаказ/Forms/ПроверкаНоменклатуры/Ext/Form/Module.bsl
&НаСервере
Процедура ОпределитьРезультатНаСервере()
	//Результат=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.СписаниеВЗаказ(Номенклатура);
	ТипСписания=Неопределено;
	КатегорияЭксплуатации=Неопределено;
	Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило(Номенклатура,ДокументРасхода);
	Если ЗначениеЗаполнено(Правило) Тогда
	ТипСписания=Правило.ТипСписания;
	КатегорияЭксплуатации=Правило.КатегорияЭксплуатации;
	
	КонецЕсли;
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОпределитьРезультат(Команда)
	ОпределитьРезультатНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВнутреннееПотреблениеТоваровТовары.Номенклатура КАК Номенклатура
	|ИЗ
	|	Документ.ВнутреннееПотребление.Товары КАК ВнутреннееПотреблениеТоваровТовары
	|ГДЕ
	|	ВнутреннееПотреблениеТоваровТовары.Ссылка.Проведен
	|	И НЕ ВнутреннееПотреблениеТоваровТовары.Ссылка.ПометкаУдаления
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Склад = &Склад
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Организация = &Организация
	|	И ВнутреннееПотреблениеТоваровТовары.Ссылка.Дата МЕЖДУ &Дата1 И &Дата2";
	Запрос.УстановитьПараметр("Склад",Склад );
	Запрос.УстановитьПараметр("Организация",Организация );
	Запрос.УстановитьПараметр("Дата1",Период.ДатаНачала );
	Запрос.УстановитьПараметр("Дата2",Период.ДатаОкончания );
	
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Товары.Очистить();
	Номер=0;
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Справочники.Лико_МастерНастройкиСтатьиРасходаДляНоменклатуры.ОпределитьСтатьюРасходов(Выборка.Номенклатура)) ТОгда
			Номер=Номер+1;
			НовыйТовар=Товары.Добавить();
			НовыйТовар.Номер=Номер;
			НовыйТовар.Номенклатура=Выборка.Номенклатура;
		КонецЕсли;
		
		
		
	КонецЦикла; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Команда1НаСервере()
	Правило=Справочники.Лико_ПравилаСписанияНоменклатурыПодЗаказ.ОпределитьПравило2(Номенклатура,ДокументРасхода); 
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
